# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были 
# повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть. 
# Количество монет и их положение (0 или 1) пользователь вводит с клавиатуры.
# Примеры/Тесты:
# Введите кол-во монет>? 5
# Положение монеты 0: 0 или 1>? 1
# ...
# 1 0 1 1 0
# Кол-во монет, чтобы перевернуть: 2

n = int(input("Введите кол-во монет: "))
count_heads = 0
count_tails = 0
for i in range(n):
    n = int(input(f"Положение монеты {i+1}: " ))
    if n == 0: count_heads += 1
    if n == 1: count_tails += 1
if count_heads < count_tails:
    print(f"Кол-во монет, чтобы перевернуть: {count_heads}")
else:
    print(f"Кол-во монет, чтобы перевернуть: {count_tails}")